# CanReset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Railing..::..CanReset Property
Railing Class See Also
---
True if the railing can be reset, False otherwise.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool CanReset { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CanReset As Boolean
	Get
```

Visual C++
---
```text
public:
property bool CanReset {
	bool get ();
}
```

# Remarks
A Railing can be reset only if the railing was created in Revit later than version 9.1.
# See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace